[
    {
        "title": "Marketing Sessions",
        "url": "https://edu.opencampus.sh/en/course/558",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/558",
            "description": "How to Marketing! Lerne erste Grundlagen für den Aufbau einer zielgerichteten Marketing-Strategie. Wie definiere ich meine Alleinstellung. Wer ist meine Zielgruppe und wie spreche ich sie an. Welche Kanäle kann ich nutzen. Wie entwickle ich eine eigene Strategie.",
            "mentor": [
                "Christian Caspersen"
            ],
            "what_we_will_learn": [
                "Grundlagen, Begriffe und Methoden des Marketings",
                "Entwicklung einer Marketingstrategie",
                "Verschiedene Anwendungsbereiche von Marketing"
            ],
            "day_time_summary": "WEDNESDAY 16:00 - 19:00",
            "ects": "2,5",
            "location": "KIEL",
            "language": "DEUTSCH",
            "information": "Du interessierst dich für Marketing:Du interessierst dich für Marketing und möchtest die Mechanismen dahinter besser verstehen und auch anwenden können? Gemeinsam machen wir uns auf den Weg und entwickeln eine Marketingstrategie. Von der ersten Idee bis zur lösungsorientierten Marken- und Kommunikationsstrategie. Auf diesem Weg lernst du unterschiedliche Tools und Methoden kennen, wie du sie einsetzt und mit welcher du deine Ziele erreichen kannst. Dabei fokussieren wir uns auf die Umsetzung. Wie baust du deine Marken- oder Produktkommunikation auf, wie findest du deine Zielgruppe und welche Kanäle und Methoden kannst du nutzen. Am Ende des Kurses hast du ein klares Bild, wie deine Marketingstrategie aussehen kann.Inhalte und Ziele:Der Workshop ist interaktiv aufgebaut und wendet sich an alle Interessierten zum Thema Marketing und Markenbildung. Auch Gründer:innen, die ihre eigene Strategie verfeinern oder ausbauen möchten, finden hier nützliche Tools, um besser mit ihrer Zielgruppe zu kommunizieren. Vorkenntnisse sind keine nötig.",
            "course_sessions": [
                {
                    "date": "30.04.2025",
                    "time": "16:00 - 19:00",
                    "topic": "Grundlagen des Marketings",
                    "location_text": "COBL, Legienstr. 40, 24103 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=COBL%2C%20Legienstr.%2040%2C%2024103%20Kiel"
                },
                {
                    "date": "07.05.2025",
                    "time": "16:00 - 19:00",
                    "topic": "Eigene Projektziele und Zielgruppen definieren",
                    "location_text": "COBL, Legienstr. 40, 24103 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=COBL%2C%20Legienstr.%2040%2C%2024103%20Kiel"
                },
                {
                    "date": "14.05.2025",
                    "time": "16:00 - 19:00",
                    "topic": "Kanäle und Ansprache",
                    "location_text": "COBL, Legienstr. 40, 24103 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=COBL%2C%20Legienstr.%2040%2C%2024103%20Kiel"
                },
                {
                    "date": "21.05.2025",
                    "time": "16:00 - 19:00",
                    "topic": "Eigene Marketingstrategie ausarbeiten",
                    "location_text": "COBL, Legienstr. 40, 24103 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=COBL%2C%20Legienstr.%2040%2C%2024103%20Kiel"
                }
            ]
        }
    },
    {
        "title": "Start a Startup",
        "url": "https://edu.opencampus.sh/en/course/546",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/546",
            "description": "Bist du bereit, dein eigenes Startup zu gründen, aber dir fehlt noch das nötige Wissen und die passenden Fähigkeiten, um erfolgreich zu starten?\n\nBitte bewerbe dich zu diesem Kurs mit einer Idee und schreibe ein paar Zeilen dazu.",
            "mentor": [
                "Cynthia David"
            ],
            "what_we_will_learn": [
                "Grundlagen zu Geschäftsmodellentwicklung, Marketing, Gründung und Steuern.",
                "Eine Idee für ein Startup mithilfe des Lean-Startup-Ansatzes zu konkretisieren und am Markt zu testen.",
                "Mithilfe von erfahrenen Mentor:innen aus dem Gründungsbereich ein Geschäftsmodell zu schärfen und ein Netzwerk aufzubauen.",
                "Das Startup-Projekt am Ende vor Publikum zu pitchen."
            ],
            "day_time_summary": "TUESDAY 16:00 - 18:00",
            "ects": "2,5",
            "location": "KIEL",
            "language": "DEUTSCH",
            "information": "Darum geht's:Bist du bereit, aus deiner Idee ein erfolgreiches Startup zu machen? Wohnst du in Schleswig-Holstein und möchtest dein eigenes Unternehmen gründen, weißt aber nicht, wo du anfangen sollst? Unser Kurs \"Start a Startup\" hilft dir, innerhalb von nur zwei Monaten dein Konzept zu konkretisieren und mit Hilfe des Lean Startup Ansatzes dein Produkt oder Konzept auf den Markt zu bringen. Egal, ob du Einzelkämpfer:in bist oder bereits ein Team hast, wir begleiten dich auf deinem Weg zum Startup. Du hast eine Idee, wie man Menschen helfen oder die Welt nachhaltiger gestalten kann? Wir unterstützen dich dabei, deine Ideen in die Tat umzusetzen und erfolgreich am Markt zu platzieren. Ganz egal wie groß oder klein dir deine Idee erscheint! Das Beste daran: Vorkenntnisse sind nicht erforderlich! Also worauf wartest du noch? Melde dich jetzt für unseren Kurs \"Start a Startup\" an und lass uns gemeinsam deine Idee auf die nächste Stufe bringen. Das Modul Start a Startup ist Teil unseres Digital Entrepreneurship Degrees.So funktioniert's:Mit Workshops zu den Themen Prototyping, Produktentwicklung, Design, Website-Bau, Preisgestaltung, Marketing, Gründung und Steuern sowie allgemeinen Startup Basics, geben wir das Wissen mit auf den Weg, das du brauchst, um richtig durchzustarten. Bei Gesprächen mit unseren erfahrenden Mentor:innen, die selbst schon den Weg einer erfolgreichen Gründung gegangen sind, kannst du dein Geschäftsmodell zudem schärfen und ein Netzwerk aufbauen. Das Finale bildet der Pitch auf unserem Demo Day bei dem du die Chance hast, dein junges Startup der Öffentlichkeit vorzustellen.",
            "course_sessions": [
                {
                    "date": "15.04.2025",
                    "time": "16:00 - 17:30",
                    "topic": "Onboarding, Lean Startup, Problem Hypothesen & Problem Interviews",
                    "location_text": "starterkitchen.de | Kuhnkestraße 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=starterkitchen.de%20%7C%C2%A0Kuhnkestra%C3%9Fe%206%2C%2024118%20Kiel"
                },
                {
                    "date": "22.04.2025",
                    "time": "16:00 - 17:30",
                    "topic": "Feedback",
                    "location_text": "starterkitchen.de | Kuhnkestraße 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=starterkitchen.de%20%7C%C2%A0Kuhnkestra%C3%9Fe%206%2C%2024118%20Kiel"
                },
                {
                    "date": "29.04.2025",
                    "time": "16:00 - 18:00",
                    "topic": "Lösungshypothesen, MVP  & (Social) Business Model Canvas",
                    "location_text": "starterkitchen.de | Kuhnkestraße 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=starterkitchen.de%20%7C%C2%A0Kuhnkestra%C3%9Fe%206%2C%2024118%20Kiel"
                },
                {
                    "date": "06.05.2025",
                    "time": "16:00 - 17:30",
                    "topic": "Feedback",
                    "location_text": "starterkitchen.de | Kuhnkestraße 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=starterkitchen.de%20%7C%C2%A0Kuhnkestra%C3%9Fe%206%2C%2024118%20Kiel"
                }
            ]
        }
    },
    {
        "title": "Startup Sessions",
        "url": "https://edu.opencampus.sh/en/course/547",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/547",
            "description": "Erfahre mehr über die spannenden (regionalen) Gründer:innengeschichten und die aktuellen Herausforderungen der Startup-Teams & Unternehmen.",
            "mentor": [
                "Mareike Springer",
                "Cynthia David"
            ],
            "what_we_will_learn": [
                "Grundlagen und Modelle zur Startup-Gründung",
                "Best Practices von regionalen Akteuren, die selbst gegründet haben",
                "Beispiele von verschiedenen Wegen zur Gründung in der Praxis"
            ],
            "day_time_summary": "THURSDAY 14:30 - 17:45",
            "ects": "2,5",
            "location": "KIEL",
            "language": "DEUTSCH",
            "information": "Dein Interesse:Du interessierst dich für das Thema Gründung und möchtest mehr über die Prozesse dahinter erfahren? Du findest es spannend, wie sich Startups entwickeln und suchst vielleicht sogar Kontaktmöglichkeiten zu der Branche? Du möchtest die verschiedenen Orte kennenlernen, an denen Startups arbeiten und Unterstützung unterhalten? Dann kommt mit uns auf eine kleine Reise durch den Gründungskosmos von Kiel!Die Inhalte:Mit den Sessions hast du die Möglichkeit, Gründer:innen und auch viele Unternehmen aus verschiedenen Bereichen direkt kennenzulernen. Wir werden an vier verschiedenen Terminen Orte in Kiel besuchen, an denen Startups arbeiten und Unterstützung erhalten. Hier stellen sich jeweils 3-4 Startups und Unternehmen vor, wir kommen gemeinsam in den Austausch und hier und da können Produkte getestet und Feedback gegeben werden. Du wirst nach den Sessions besser verstehen, wie Unternehmen erfolgreich werden und wie Prozesse, insbesondere in kleinen Unternehmen, ablaufen. Du solltest dabei sein, falls du dich für Startups interessierst, falls du direkte Kontakte zu Unternehmen suchst, und falls du dir vorstellen kannst, bei einem Startup zu arbeiten, in dem du selbst viel gestalten kannst. Du lernst junge Unternehmen aus Schleswig-Holstein und Umgebung kennen. Im Fokus stehen die Themen Gründung und Innovation. Dabei werden auch praxisorientierte Grundlagen für Gründungsinteressierte und Neugierige u.a. in den Bereichen Organisation, Marketing, Vertrieb und Personalführung vermittelt. Die Veranstaltung wird in Kooperation mit verschiedenen regionalen Unternehmen und Organisationen durchgeführt.",
            "course_sessions": [
                {
                    "date": "24.04.2025",
                    "time": "14:30 - 17:45",
                    "topic": "Starterkitchen",
                    "location_text": "Kuhnkestraße 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Kuhnkestra%C3%9Fe%206%2C%2024118%20Kiel"
                },
                {
                    "date": "15.05.2025",
                    "time": "14:30 - 17:45",
                    "topic": "Kieler Innovations- und Technologiezentrum",
                    "location_text": null,
                    "location_url": null
                },
                {
                    "date": "22.05.2025",
                    "time": "14:30 - 17:45",
                    "topic": "Fleet7",
                    "location_text": "Fleethörn 7, 24103 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Fleeth%C3%B6rn%207%2C%2024103%20Kiel"
                },
                {
                    "date": "05.06.2025",
                    "time": "14:30 - 17:45",
                    "topic": "Zentrum für Entrepreneurship",
                    "location_text": "Westring 423, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Westring%20423%2C%2024118%20Kiel"
                }
            ]
        }
    },
    {
        "title": "E-Sport Job Sessions",
        "url": "https://edu.opencampus.sh/en/course/550",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/550",
            "description": "Lerne verschiedene Tätigkeitsfelder im E-Sport kennen und erlange so einen Einblick in die Szene und Branche!",
            "mentor": [
                "Jan Grote",
                "David  Eitel",
                "Daniela Stahl"
            ],
            "what_we_will_learn": [],
            "day_time_summary": "TUESDAY 18:00 - 19:30",
            "ects": "NONE",
            "location": "ONLINE",
            "language": "DEUTSCH",
            "information": null,
            "course_sessions": [
                {
                    "date": "15.04.2025",
                    "time": "18:00 - 19:30",
                    "topic": "Session 1 - Auftakt",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "22.04.2025",
                    "time": "18:00 - 19:30",
                    "topic": "Session 2 - Geschäftsführer E-Sport Organisation - Felix Kollath",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "29.04.2025",
                    "time": "18:00 - 19:30",
                    "topic": "Session 3 - E-Sport Trainer*in - Sebastian Bauersachs",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "06.05.2025",
                    "time": "18:00 - 19:30",
                    "topic": "Session 4 - E-Sport Consultant",
                    "location_text": "ONLINE",
                    "location_url": null
                }
            ]
        }
    },
    {
        "title": "Future of Food",
        "url": "https://edu.opencampus.sh/en/course/549",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/549",
            "description": "Genüsslich erfährst du, wie verschiedene Unternehmen aus Kiel und der Region sich ihre eigene Existenz im Food-Bereich aufgebaut haben und welche Hürden sie dafür überwinden mussten.",
            "mentor": [
                "Marcel Lungershausen"
            ],
            "what_we_will_learn": [
                "Grundlagen zum Aufbau und Management eines Food-Startups",
                "Best Practices von Akteur:innen aus der Praxis",
                "Aktuelle Entwicklungen und Themen der Food-Branche"
            ],
            "day_time_summary": "WEDNESDAY 15:00 - 16:30",
            "ects": "2,5",
            "location": "ONLINE",
            "language": "DEUTSCH",
            "information": "Dein Interesse:Du interessierst dich für das Thema (nachhaltige) Ernährung und möchtest gerne aus erster Hand von Unternehmen und Startups erfahren, wie man sich in der Branche ein eigenes Standbein aufbauen kann? Du kannst dir vorstellen, später im Bereich Food- und Gastro-Innovation tätig zu werden und ein eigenes Projekt zu starten? Dann bist du hier richtig!Die Inhalte:In den Sessions lernst du ein großes Netzwerk an Genuss-Begeisterten kennen und bekommst Einblicke in Food-Startups aus der Region. Wir sprechen über nachhaltige Ernährung und wollen dir die regionalen und saisonalen Produkte näher bringen. Gleichzeitig möchten wir die norddeutsche Esskultur neu aufleben lassen und dich dafür begeistern. Junge und etablierte Unternehmer:innen sprechen über Ideenentwicklung und Umsetzung, teilen ihre Unternehmensstrategien und zeigen Wege einer klimafreundlichen und ressourcenschonenden Unternehmensphilosophie. Deine Kursleitung: Der Kurs wird von der Cocina Kiel organisiert. Weitere Infos zu dem Projekt findest du hier: https://www.cocina-kiel.de",
            "course_sessions": [
                {
                    "date": "16.04.2025",
                    "time": "15:00 - 16:30",
                    "topic": "Kennenlernen: Was sind eure Interessen & Backgrounds",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "23.04.2025",
                    "time": "15:00 - 16:30",
                    "topic": "Gemeinsames Kochen und Vernetzen",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "30.04.2025",
                    "time": "15:00 - 16:30",
                    "topic": "Fermentation: Essen der Zukunft? Was ist Wasserkefir?",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "07.05.2025",
                    "time": "15:00 - 16:30",
                    "topic": "Süße Einblicke in die Startupwelt der Cocina - Le petit gâteau stellt sich vor",
                    "location_text": "ONLINE",
                    "location_url": null
                }
            ]
        }
    },
    {
        "title": "Startup Fundamentals",
        "url": "https://edu.opencampus.sh/en/course/548",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/548",
            "description": "In den Startup Fundamentals lernst du die Grundlagen rund um die Themen Business-Plan, digitale Geschäftsmodelle, BWL-Grundlagen und Lean Startup.",
            "mentor": [
                "Cynthia David",
                "Tuba Ercan"
            ],
            "what_we_will_learn": [
                "Ideenbeschaffung und Bewertung",
                "Gründungsteam aufbauen",
                "Planung eines MVP (Minimum Viable Product)",
                "Productlaunching",
                "Wachstum und Monetarisierung",
                "Kapitalbeschaffung und Unternehmensaufbau"
            ],
            "day_time_summary": null,
            "ects": "2,5",
            "location": "ONLINE",
            "language": "DEUTSCH",
            "information": "Dein Interesse:Unser Selbstlernkurs ist für zwei Zielgruppen gedacht: Du arbeitest noch nicht an einem Startup, denkst aber darüber nach, eines Tages eines zu gründen, und möchtest lernen, wie man es macht. Du hast bereits eine Idee und arbeitest aktiv daran, könntest aber Ratschläge zur Validierung des Konzepts, zur Markteinführung und zur Gewinnung der ersten Nutzer:innen gebrauchen. Dieser englischsprachige Kurs ist als Self-Learning-Format angesetzt. Es wird jedoch ein gemeinsames Onboarding, sowie einen Abschlusstermin geben. Das Modul Startup Fundamentals ist Teil unseres Digital Entrepreneurship Degrees. Teilnehmer:innen des Digital Entrepreneurship Degrees erhalten bevorzugten Zugang zu diesem Kurs.Die Inhalte:Im Laufe des Semesters geht ihr durch die verschiedenen Kapitel der Ideation (Ideengenerierung) und durchlauft das Programm der Startup School des berühmten Y-Combinators aus dem Silicon Valley sowie einige Module der Deep Dive School. Beide Programme sind englischsprachig und kostenfrei für (angehende) Gründer:innen. Während des Kurses wollen wir Folgendes erreichen: Euch ermutigen und inspirieren, ein Unternehmen zu gründen, um die Welt positiv zu beeinflussen. Euch vermitteln, wie man ein Startup gründet, und euch mit den Ressourcen und Werkzeugen ausstatten, die euch jetzt und in Zukunft darauf vorbereiten. Aufbau einer Gemeinschaft von Unternehmer:innen, die sich gegenseitig ermutigen, unterrichten und unterstützen können.",
            "course_sessions": [
                {
                    "date": "14.04.2025",
                    "time": "17:00 - 18:30",
                    "topic": "Onboarding (verpflichtend)",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "19.05.2025",
                    "time": "17:00 - 17:30",
                    "topic": "Q&A",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "16.06.2025",
                    "time": "17:00 - 17:30",
                    "topic": "Q&A insbes. zur Prüfungsleistung",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "30.06.2025",
                    "time": "17:00 - 20:00",
                    "topic": "Online-Pitch (verpflichtend)",
                    "location_text": "ONLINE",
                    "location_url": null
                }
            ]
        }
    },
    {
        "title": "Digital Marketing & E-Commerce",
        "url": "https://edu.opencampus.sh/en/course/545",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/545",
            "description": "Du erhältst aktuelle Kenntnisse über erfolgreiche Online-Marketing-Kanäle, die zur Kundengewinnung und Kundenbindung im E-Commerce eingesetzt werden können und setzt am Ende eine eigenen Kampagne um.",
            "mentor": [
                "Cynthia David"
            ],
            "what_we_will_learn": [
                "Strategien und Wirkungen von Online-Marketing verstehen",
                "Passende Instrumente für Kunden/Situationen auswählen",
                "Instrumentenbezogenes Controlling anwenden",
                "Online-Marketing in Marketing-Strategie integrieren",
                "Referenzarchitektur von Shopsystemen verstehen"
            ],
            "day_time_summary": "MONDAY",
            "ects": "5",
            "location": "ONLINE",
            "language": "ENGLISCH",
            "information": "Dein Interesse:NEW: DER KURS STEHT IN ENGLISCH & DEUTSCH ZUR VERFÜGUNG! Du interessierst dich für Digital Marketing & E-Commerce und möchtest gerne die Grundlagen erlernen? Du möchtest beispielsweise wissen, wie man Kund:innen über digitale Marketingkanäle erreicht oder durch einen Aufbau von E-Commerce Shops und der Analyse der Online-Performance die Kundentreue steigert? In diesem Kurs lernst du außerdem Tools und Plattformen wie Canva, Constant Contact, Google Ads, Google Analytics, Hootsuite, HubSpot, Mailchimp und Shopify kennen. Dieser Kurs ist als Self-Paced-Learning-Format über Coursera angesetzt. Das hießt, es gibt keine vorgegeben Kurszeiten – ihr lernt in eurem eigenen Tempo! Es wird jedoch ein gemeinsames Onboading, sowie einen Abschlusstermin geben. Das Modul Digital Marketing & E-Commerce ist Teil unseres Digital Entrepreneurship Degrees. Teilnehmer:innen des Digital Entrepreneurship Degrees erhalten bevorzugten Zugang zu diesem Kurs.Die Inhalte:• Strategien und operative Wirkungen einzelner Online-Marketing-Instrumente (Banner-Werbung, E-Mail-Marketing, Suchmaschinen-Marketing, Affiliate Marketing, Social Media Marketing) • Verständnis für den kundengerechten Einsatz der verschiedenen Instrumente • Kenntnisse hinsichtlich der Ansatzpunkte für ein instrumentenbezogenes Controlling • Fähigkeit, das Online Marketing in die gesamte Marketingstrategie eines Unternehmens zu integrieren E-Commerce: • Online-Shopping-Kaufprozess und die wesentlichen Gemeinsamkeiten sowie Unterschiede zum klassischen Kaufprozess • Marktstruktur im deutschen E-Commerce-Markt und dessen Entwicklung • Referenzarchitektur von Shopsystemen (generelles Systemkonzept) und wesentliche Funktionalitäten der Systemkomponenten und deren Bedeutung bzw. Einsatz im Kaufprozess • Generelle Anforderungen an Shopsysteme aus Betreibersicht und aus Kundensicht in verschiedenen Nutzungskontexten (z. B. auf verschiedenen Endgeräten • Realisierungskonzepte für Produktkataloge (Datenmodelle, Attribute, Suchverfahren, Einbindung in Shopsysteme) • Definition und Abgrenzung von Empfehlungssystemen und Wissen um die Bedeutung im E-Commerce sowie Kenntnis der Kategorien von Empfehlungssystemen bezogen auf die Art der Nutzung der Informationsbasis und der damit verbundenen Potenziale und Restriktionen • Aktuelle Marktsituation bezogen auf Shopsysteme, Empfehlungssysteme, Zahlungssysteme und weiterer Komponenten (Anbieter, Ausprägungen, Marktposition)",
            "course_sessions": [
                {
                    "date": "14.04.2025",
                    "time": "18:00 - 18:30",
                    "topic": "Onboarding",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "28.04.2025",
                    "time": "23:45 - 00:00",
                    "topic": "Rückmeldung mit aktuellen Stand via mattermost (kein Zoom Termin!)",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "30.06.2025",
                    "time": "23:45 - 00:00",
                    "topic": "Abgabe der Leistungsnachweise via edu (kein Zoom Termin!)",
                    "location_text": "ONLINE",
                    "location_url": null
                }
            ]
        }
    },
    {
        "title": "Projektmanagement Sessions",
        "url": "https://edu.opencampus.sh/en/course/540",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/540",
            "description": "Lerne die Praktiken von Projektmanagement in unterschiedlichen Unternehmen und Organisationen kennen!",
            "mentor": [
                "Susann  Abraham"
            ],
            "what_we_will_learn": [
                "Best Practices von Akteuren aus der Praxis im Bereich Projektmanagement kennenlernen",
                "Verschiedene Anwendungsbereiche von Projektmanagement in der Praxis beschreiben",
                "Grundlagen, Methoden und Begriffe des Projektmanagements an Praxisbeispielen einordnen"
            ],
            "day_time_summary": null,
            "ects": "2,5",
            "location": "KIEL",
            "language": "DEUTSCH",
            "information": "Dein Interesse:Du interessierst dich für Projektmanagement und möchtest mehr darüber erfahren, wie Projektmanagement in großen und kleinen Unternehmen aus verschiedenen Branchen umgesetzt wird? Du möchtest herausfinden, wie andere Unternehmen und Organisationen Projekte organisieren und auf welche Herausforderungen sie stoßen und wie sie damit umgehen? Du hast Interesse daran, Unternehmen und Organisationen kennenlernen und dich mit ihnen zu vernetzen? Hinweis: Dieser Kurs findet im April/Mai in Präsenz in Kiel statt.Die Inhalte:Bei den Projektmanagement Sessions werden Referent:innen aus verschiedenen Unternehmen und Organisationen aus dem Nähkästchen plaudern – sie werden von ihren Erfahrungen, Fehlern, Herausforderungen und wie sie diese bewältigen, berichten. Ihr werdet kennenlernen, was es in der Praxis heißt, in Projekten zu arbeiten und Projekte zu leiten, wie sich Teams organisieren und welche Tools sie verwenden. Darüberhinaus werden sich die Referent:innen natürlich euren Fragen stellen!",
            "course_sessions": [
                {
                    "date": "16.04.2025",
                    "time": "14:00 - 18:00",
                    "topic": "Projektmanagement Workshop",
                    "location_text": "Starterkitchen, Kuhnkestr. 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen%2C%20Kuhnkestr.%206%2C%2024118%20Kiel"
                },
                {
                    "date": "30.04.2025",
                    "time": "15:00 - 18:00",
                    "topic": "Agiles Projektmanagement - AWO Bildungscampus",
                    "location_text": "Starterkitchen, Kuhnkestr. 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen%2C%20Kuhnkestr.%206%2C%2024118%20Kiel"
                },
                {
                    "date": "14.05.2025",
                    "time": "15:00 - 18:00",
                    "topic": "Projektmanagement in Design & Softwareentwicklung",
                    "location_text": "Starterkitchen, Kuhnkestr. 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen%2C%20Kuhnkestr.%206%2C%2024118%20Kiel"
                },
                {
                    "date": "28.05.2025",
                    "time": "15:00 - 18:00",
                    "topic": "Projektmanagement in einer Kreativagentur | New Communication",
                    "location_text": "Starterkitchen, Kuhnkestr. 6, 24118 Kiel",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen%2C%20Kuhnkestr.%206%2C%2024118%20Kiel"
                }
            ]
        }
    },
    {
        "title": "Social Media Sessions",
        "url": "https://edu.opencampus.sh/en/course/539",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/539",
            "description": "Hier erfährst du, wie Social Media in der Praxis verstanden, geplant und angewendet wird.",
            "mentor": [
                "Anatolii Chubarev",
                "Francesca Radulescu"
            ],
            "what_we_will_learn": [
                "Grundlagen, Methoden und Strategien von Social Media Marketing",
                "Best Practices von Akteuren aus der Praxis im Bereich Social Media",
                "Verschiedene Anwendungsbereiche und Tools für Social Media"
            ],
            "day_time_summary": null,
            "ects": "2,5",
            "location": "KIEL",
            "language": "DEUTSCH",
            "information": "Für wen ist der Kurs geeignet?Du interessierst dich für das Thema Social Media und möchtest gerne wissen, wie Unternehmen, Institutionen und Selbstständige auf verschiedenen Kanälen agieren? Du kannst dir vorstellen später im Bereich Online-/Social-Media-Marketing tätig zu werden? Vielleicht bist du auch sogar schon im Social-Media-Bereich für ein Unternehmen oder ein eigenes Projekt unterwegs und möchtest dich mit anderen darüber austauschen? In allen Fällen bist du hier richtig!Was erwartet dich?Unternehmen und Referen:tinnen verschiedenster Branchen geben dir ein ganzes Wochenende verschiedene Einblicke und bieten dir so die Möglichkeit, in ihre Social-Media-Praxis einzutauchen. Wann ist der richtige Zeitpunkt für ein Posting? Wie erreiche ich meine Zielgruppe und wozu muss ich diese überhaupt genau definieren? Was mache ich, wenn ein Shitstorm über meinen Post hereinbricht? Welche Werkzeuge bieten mir eine bestmögliche Auswertung? Welche sprachliche Form ist angebracht? Was mache ich, wenn es nicht so läuft wie erwünscht? Und wie bekomme ich eigentlich maximale Reichweite? Diese und viele weitere Fragen werden dir im Rahmen der Social Media Sessions beantwortet. So lernst du einfache, aber wirkungsvolle Mechanismen für Aktivitäten in sozialen Netzwerken zu nutzen.",
            "course_sessions": [
                {
                    "date": "13.06.2025",
                    "time": "15:00 - 18:00",
                    "topic": "Tag 1",
                    "location_text": "Starterkitchen",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen"
                },
                {
                    "date": "14.06.2025",
                    "time": "11:00 - 18:00",
                    "topic": "Tag 2",
                    "location_text": "Starterkitchen",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen"
                },
                {
                    "date": "15.06.2025",
                    "time": "11:00 - 15:00",
                    "topic": "Tag 3",
                    "location_text": "Starterkitchen",
                    "location_url": "https://www.google.com/maps/search/?api=1&query=Starterkitchen"
                }
            ]
        }
    },
    {
        "title": "Digital Prototyping & Product Development",
        "url": "https://edu.opencampus.sh/en/course/544",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/544",
            "description": "Nach Abschluss von Digital Prototyping & Product Development bist du in der Lage, kreative Produktideen in Markterfolge zu überführen und hast bereits erste digitale Prototypen erstellt.",
            "mentor": [
                "Cynthia David"
            ],
            "what_we_will_learn": [
                "Grundlegende Kenntnisse in User Experience Design, User Research, Usability Testing",
                "Erstellung von digitalen Wireframes, Mockups und App/Web-Prototypen",
                "Grundlegende Kenntnisse in Figma und Adobe XD",
                "Anwendungsbereiche von User Experience Design in der Praxis und Best Practices"
            ],
            "day_time_summary": "MONDAY",
            "ects": "5",
            "location": "ONLINE",
            "language": "DEUTSCH",
            "information": "Dein Interesse:TEILNAHME AUF ENGLISCH & DEUTSCH MÖGLICH. Du interessierst dich für Digital Prototyping & Product Development und möchtest wissen, wie digitale Produkte geplant, erstellt und veröffentlicht werden? In diesem Kurs lernst du u.a. wie man Prototypen und Wireframes auf Papier und in digitalen Design-Tools wie Figma und Adobe XD erstellt und anschließend auf die Usability testet. Du lernst nicht nur die Grundlagen des UX-Designs kennen, sondern auch wie du deine eigenen Designs testen und so eine optimale Anwendung schaffst. Dieser Kurs setzt sich aus mehreren praktischen Lernprojekten zusammen. Dieser Kurs ist als Self-Paced-Learning-Format über coursera angesetzt. Das hießt, es gibt keine vorgegeben Kurszeiten - ihr lernt in eurem eigenen Tempo! Es wird jedoch ein gemeinsames Onboading, sowie einen Abschlusstermin geben. Das Modul Digital Prototyping & Product Development ist Teil des Digital Entrepreneurship Degrees, welches in Zusammenarbeit mit der FH Kiel und FH Wedel organisert wird. Teilnehmer:innen des Digital Entrepreneurship Degrees erhalten bevorzugten Zugang zu diesem Kurs.Die Inhalte:Teilnehmer:innen sind in der Lage, kreative Produktideen in Markterfolge zu überführen. Dafür beherrschen sie alternative methodische Herangehensweisen, die im Rahmen der Einheit erläutert werden und teilweise in kleineren Praxisprojekten zur Anwendung kommen. Dabei werden digitale Prototypen toolgestützt entwickelt. Kursinhalte: Benutzererfahrung (UX) Tools für Prototyping und Mockups (Marvelapp, Figma uvm.) Tech Dev Basics: SW-Frameworks UX-Forschung Usability-Tests / A-B Testing",
            "course_sessions": [
                {
                    "date": "14.04.2025",
                    "time": "18:30 - 19:00",
                    "topic": "Onboarding",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "28.04.2025",
                    "time": "23:45 - 00:00",
                    "topic": "Rückmeldung mit aktuellen Stand via mattermost (kein Zoom Termin!)",
                    "location_text": "ONLINE",
                    "location_url": null
                },
                {
                    "date": "30.06.2025",
                    "time": "23:45 - 00:00",
                    "topic": "Abgabe der Leistungsnachweise via edu (kein Zoom-Termin!)",
                    "location_text": "ONLINE",
                    "location_url": null
                }
            ]
        }
    }
]