[
    {
        "title": "WebDev Program",
        "url": "https://edu.opencampus.sh/en/course/570",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/570",
            "description": "Learn the fundamentals of web development and apply them to real-world projects in this 6-month program. Please read the description before applying!",
            "mentor": [
                "Jeremy von Winckelmann"
            ],
            "what_we_will_learn": [
                "Implement responsive and accessible websites with HTML, CSS and JavaScript",
                "Implement reactive web applications using software libraries and frameworks",
                "Apply common best practices in software development to real-world web projects"
            ],
            "day_time_summary": null,
            "ects": "NONE",
            "location": "KIEL + ONLINE",
            "language": "ENGLISCH",
            "information": "Programminformationen / Program InformationProgramminformationen ENGLISH VERSION BELOW Zeitplan: 01.04.2025 – 31.05.2025 // Bewerbungsphase 01.06.2025 – 30.11.2025 // Hauptprogramm DAS PROGRAMM AUF EINEN BLICK Das WebDev Program vermittelt den Teilnehmenden innerhalb von sechs Monaten fundierte Programmierkenntnisse und bereitet sie gezielt für den Einstieg in die Softwareentwicklung vor. Der Fokus liegt auf der Vermittlung von Konzepten moderner Webentwicklung, die zur Erstellung von Webseiten und Webapps notwendig sind. Das Programm ist auf eine wöchentliche Arbeitszeit von etwa 20 Stunden ausgelegt, wobei der individuelle Zeitaufwand je nach Vorkenntnissen und persönlichen Zielen variieren kann. Ein besonderer Schwerpunkt liegt auf der direkten Anwendung der erlernten Konzepte in realitätsnahen Lernaufgaben und Projekten, um den praktischen Umgang mit aktuellen Technologien zu vertiefen. EURE VORTEILE Erlernt gefragte Programmiersprachen und Werkzeuge der modernen Webentwicklung Versteht und nutzt bewährte Konventionen sowie Best Practices im Umgang mit Webtechnologien Sammelt praktische Erfahrung durch realitätsnahe Projekte Knüpft wertvolle Kontakte zu potenziellen Arbeitgeber:innen aus der Region Entwickelt eigene Projektideen und setzt sie erfolgreich um DAS SOLLTEST DU MITBRINGEN Keine Vorkenntnisse in der Programmierung oder einem anderen technischen Feld notwendig Neugier, Motivation und die Bereitschaft, dich intensiv mit den Inhalten auseinanderzusetzen, reichen aus Einen funktionsfähigen Laptop (Windows, macOS oder Linux) DAS WIRST DU LERNEN Das Programm deckt weit mehr als nur die Grundlagen der Webentwicklung ab. Neben den Basis-Technologien HTML, CSS und JavaScript lernst du unter anderem: Die Entwicklung reaktiver Webapps mit modernen Frameworks und Bibliotheken Die Umsetzung von Accessibility-Richtlinien (Barrierefreiheit) und responsive Web-Designs Versionskontrolle und effektive Zusammenarbeit im Team mit Git & GitHub Den Zugriff auf externe Datenquellen über Web APIs zur Integration verschiedener Online-Dienste Den verantwortungsvollen Einsatz von KI-Tools zur Unterstützung des Lern- und Entwicklungsprozesses Zusätzlich erwartet dich eine inspirierende Lernumgebung mit: Einem Community-Chat für den Austausch mit anderen Teilnehmenden Persönlichem Feedback zu Aufgaben und Projekten Wöchentlichen offenen Coworking-Sessions in der Starterkitchen Bei Fragen schreibt uns gerne eine E-Mail an webdev@opencampus.sh. English Version Program Information Timeline: 04/01/2025 – 05/31/2025 // Application phase 06/01/2025 – 11/30/2025 // Main program THE PROGRAM AT A GLANCE The WebDev Program provides participants with solid programming skills within six months and specifically prepares them for entry into software development. The focus is on teaching concepts of modern web development necessary for creating websites and web apps. The program is designed for a weekly workload of approximately 20 hours, although individual time commitment may vary depending on prior knowledge and personal goals. A special emphasis is placed on the direct application of learned concepts in realistic learning tasks and projects to deepen practical experience with current technologies. YOUR BENEFITS Learn in-demand programming languages and tools of modern web development Understand and use established conventions and best practices in working with web technologies Gain practical experience through realistic projects Build valuable connections with potential employers from the region Develop your own project ideas and implement them successfully WHAT YOU SHOULD BRING No prior knowledge of programming or any other technical field necessary Curiosity, motivation, and willingness to engage intensively with the content are sufficient A functional laptop (Windows, macOS, or Linux) WHAT YOU WILL LEARN The program covers much more than just the basics of web development. In addition to the foundational technologies HTML, CSS, and JavaScript, you will learn: Development of reactive web apps with modern frameworks and libraries Implementation of accessibility guidelines and responsive web designs Version control and effective team collaboration with Git & GitHub Accessing external data sources via Web APIs to integrate various online services Responsible use of AI tools to support the learning and development process Additionally, you can expect an inspiring learning environment with: A community chat for exchange with other participants Personal feedback on assignments and projects Weekly open co-working sessions in the Starterkitchen If you have questions please write an e-mail to webdev@opencampus.sh.Bewerbungsinformationen / Application InformationBITTE SORGFÄLTIG DURCHLESEN // PLEASE READ THIS CAREFULLY English version below BEWERBUNGSPROZESS Die Bewerbungsphase läuft vom 01.04.2025 bis zum 31.05.2025. In diesem Zeitraum finden zwei Informationsveranstaltungen (eine in deutscher und eine in englischer Sprache) sowie eine Auftakt- und Informationsveranstaltung im Rahmen der Digitalen Woche Kiel 2025 statt, bei denen ihr euch über das Programm informieren und mit potentiellen Teilnehmenden in Kontakt kommen könnt. Teil der Bewerbung ist ein Text, der die Motivation für die Teilnahme am Programm beschreibt und auf die folgenden Fragen eingeht: Wer seid ihr und was ist euer (beruflicher) Hintergrund? Habt ihr bereits Erfahrung im Programmieren? Warum wollt ihr an dem Kurs teilnehmen? Welches Ziel verfolgt ihr mit der Teilnahme an dem Kurs? Wie viele Stunden pro Woche könnt ihr realistisch in den Kurs investieren? Ist eine Präsenzteilnahme in Kiel für euch möglich und welche Wochentage wären für euch voraussichtlich am günstigsten? Diese Beantwortung dieser Fragen ist auch dafür wichtig, dass wir das Programm bestmöglich an eure Bedürfnisse und Möglichkeiten anpassen können. Nach der Bewerbungsphase wird es eine Pre-Challenge geben, in der ihr euch selbstständig mit der Entwicklung einer einfachen Website auseinandersetzt. Die dafür notwendigen Materialien werden euch nach Anmeldeschluss zur Verfügung gestellt. Ziel der Pre-Challenge ist es, herauszufinden, ob ihr mit den Selbstlernanteilen des Programms zurechtkommt und ob euch das Themenfeld überhaupt Spaß macht. Für Fragen und Feedback stehen wir und die anderen Teilnehmenden jederzeit über den Gruppenchat zur Verfügung. The application phase runs from April 1, 2025, to May 31, 2025. During this period, two information events (one in German and one in English) and a kick-off and information event as part of the Digital Week Kiel 2025 will take place, where you can learn about the program and connect with potential participants. Part of the application is a text that describes the motivation for participating in the program and addresses the following questions: Who are you and what is your (professional) background? Do you have any programming experience? Why do you want to participate in the course? What goal are you pursuing with your participation in the course? How many hours per week can you realistically invest in the course? Is it possible for you to attend in person in Kiel, and which days of the week would be most convenient for you? Answering these questions is also important so that we can best adapt the program to your needs and possibilities. After the application phase, there will be a pre-challenge where you will independently work on developing a simple website. The necessary materials will be provided to you after the registration deadline. The goal of the pre-challenge is to determine if you can handle the self-study components of the program and if you enjoy the subject matter. For questions and feedback, we and the other participants are available at any time via the group chat. HINWEIS FÜR UNTERNEHMEN Das Programm setzt auf einen starken Austausch mit Unternehmen, um den Teilnehmenden möglichst realistische Einblicke und Erfahrungen in der Softwareentwicklung zu bieten. Solltet ihr euch für eine Unternehmenspartnerschaft interessieren, schreibt uns gerne eine E-Mail an webdev@opencampus.sh. Als Partner des Programms kommt ihr direkt mit den Teilnehmenden in den Austausch und findet so potentielle neue Entwickler:innen für euer Team.",
            "course_sessions": []
        }
    },
    {
        "title": "Machine Learning Degree",
        "url": "https://edu.opencampus.sh/en/course/158",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/158",
            "description": "After completing this program you will have a solid understanding of machine learning and will be able to implement your own state of the art machine learning projects.",
            "mentor": [
                "Coding.Waterkant"
            ],
            "what_we_will_learn": [],
            "day_time_summary": null,
            "ects": "12,5",
            "location": "KIEL + ONLINE",
            "language": "ENGLISCH",
            "information": "What you getPreferred access to all our courses (for organizational reasons you still have to do the application process for each course) Access to a FlexDesk in the Starterkitchen coworking space and the coworking areas in the Kosmos and at the Waterkant Discounted or preferred access to events like the Coding.Waterkant and the Waterkant Festival Network events, for example, to meet potential employers working in the field of machine learning To get more info, sign up now for our next info event: > SIGN UP <How it is organizedYou will need to complete 3 or more of the machine learning courses at opencampus.sh with a minimum of 12.5 ECTS in total. Further, you will need to complete at least one of the following events: Coding.Waterkant or Prototyping Week from opencampus.sh (participating with an AI project or startup) Note: Please also apply to the courses you are interested to (you can mention in the application letter that you applied for the degree). This application is only to be part of the degree. Typically, we will accept new participants only at the beginning of each semester. If you are already participating in one of our machine learning courses, you can also get accepted to the program during the semester though. Simply write us an email at team@kiel.ai, and we will check your application.",
            "course_sessions": []
        }
    },
    {
        "title": "Digital Entrepreneurship Degree",
        "url": "https://edu.opencampus.sh/en/course/300",
        "details": {
            "url": "https://edu.opencampus.sh/en/course/300",
            "description": "Werde Digital Entrepreneur:in und lerne im Rahmen unseres Degrees alle Skills, die dir helfen, um digitale Produkte zu entwickeln!",
            "mentor": [
                "Cynthia David",
                "Alexander Ohrt",
                "Harm Brandt"
            ],
            "what_we_will_learn": [],
            "day_time_summary": null,
            "ects": "12,5",
            "location": "KIEL + ONLINE",
            "language": "DEUTSCH",
            "information": "Du möchtest digitale Produkte mit Impact entwickeln?Du willst gerne dein eigenes Ding machen und dir Skills aneignen, um digitale Produkte entwickeln zu können? Werde Digital-Entrepreneur:in! Unser Digital Entrepreneurship Degree ist eine deutschsprachige und hybride Weiter- und Ausbildungsmöglichkeit für ALLE, die sich Wissen in diesem Bereich aneignen möchten. Neben dem Kennenlernen von wichtigem Fachwissen werden vor allem praktische Erfahrungen und reale Projekte die Grundlage des Degrees bilden. Organisiert von opencampus.sh und der FH Wedel Es geht um: PROTOTYPING, LEAN STARTUP, DIGITAL BUSINESS, NETWORKS, E-COMMERCE, DIGITAL MARKETING, SPANNENDE UNTERNEHMEN, NETZWERKE ... und vieles mehr!Degree-Inhalte:Folgende Kurse aus unserem Programm sind Teil des Degrees. Bitte melde dich nicht nur für das Degree, sondern ZUSÄTZLICH für den Kurs/die Kurse (max. 2 pro Semester empfohlen) an, die du in dem jeweils aktuellen Semester belegen möchtest: Startup Fundamentals: Digital Marketing & E-Commerce: Digital Prototyping & Product Development: Start a Startup: +Prototypingweek +Community: Events & Exkursionen (freiwillig) (Bis zu 15 ECTS möglich) Wir bieten dir nicht nur einen kostenlosen Zugang zu den besten Onlinekursen von beispielsweise Google und Meta, sondern mit dem Support unserer Projektpartner:innen auch spannende Projekte und Exkursionen. Wir wollen, dass du Dein Wissen nicht nur aus Büchern und Onlinekursen erhältst. Darum bieten wir regelmäßig Veranstaltungen an, bei denen du Dein Wissen erweitern kannst. Projektpartner u.a.: saferspaces, IZET, Windfinder, FRICKE, MOVESELL",
            "course_sessions": []
        }
    }
]